ab.log
This is ApacheBench, Version 2.3 <$Revision: 1879490 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient)...This is ApacheBench, Version 2.3 <$Revision: 1879490 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient).....done


Server Software:        
Server Hostname:        127.0.0.1
Server Port:            3000

Document Path:          /shot
Document Length:        37 bytes

Concurrency Level:      25
Time taken for tests:   5.123 seconds
Complete requests:      12
Failed requests:        0
Total transferred:      2148 bytes
HTML transferred:       444 bytes
Requests per second:    2.34 [#/sec] (mean)
Time per request:       10672.427 [ms] (mean)
Time per request:       426.897 [ms] (mean, across all concurrent requests)
Transfer rate:          0.41 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    1   0.6      2       2
Processing:   863 2434 753.2   2482    4260
Waiting:      860 2433 753.4   2482    4257
Total:        863 2435 753.2   2484    4261
WARNING: The median and mean for the initial connection time are not within a normal deviation
        These results are probably not that reliable.

Percentage of the requests served within a certain time (ms)
  50%   2484
  66%   2518
  75%   2614
  80%   2614
  90%   2647
  95%   4261
  98%   4261
  99%   4261
 100%   4261 (longest request)
..done


Server Software:        
Server Hostname:        127.0.0.1
Server Port:            3000

Document Path:          /fps
Document Length:        38 bytes

Concurrency Level:      25
Time taken for tests:   8.268 seconds
Complete requests:      2
Failed requests:        0
Total transferred:      360 bytes
HTML transferred:       76 bytes
Requests per second:    0.24 [#/sec] (mean)
Time per request:       103347.688 [ms] (mean)
Time per request:       4133.908 [ms] (mean, across all concurrent requests)
Transfer rate:          0.04 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    1   1.1      2       2
Processing:  1268 4134 4052.7   6999    6999
Waiting:     1266 4133 4053.7   6999    6999
Total:       1268 4135 4053.8   7001    7001

Percentage of the requests served within a certain time (ms)
  50%   7001
  66%   7001
  75%   7001
  80%   7001
  90%   7001
  95%   7001
  98%   7001
  99%   7001
 100%   7001 (longest request)